<a href="https://colab.research.google.com/github/AlexsanderPessoa/Aprendizado-de-Banco-de-Dados/blob/main/Aprendizado_banco_de_dados_agroadvance.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
/* DLL - Data Definition Language */

/* A linguagem de definição de dados se ocupa de modificar 
a estrutura de objetos de uma DB.

Ela é constituida por diferentes setenças que nos permite criar, 
modificar, apagar ou definir a estrutura das tabelas que 
armazenam dados. */

/* Create, Alter, Drop, Truncate */

/* atalhos para rodar: ctrl + Enter */

CREATE DATABASE AGROADVANCE;
CREATE SCHEMA AGROADVANCE2;
USE AGROADVANCE;

/* Em outros gerenciadores pode haver diferença entre 
database e schema, dentro de um schema eu posso inserir vários 
database */

/* eu chamei de agroadvance2, pois no mysql eles são iguais e 
não pode haver repetição */

CREATE TABLE pagamentos (
id_pay	INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
valor	REAL NOT NULL,
moeda	VARCHAR(20) NOT NULL,
data_pagamento DATE NOT NULL,
tipo_pagamento VARCHAR(50),
id_usuario INT NOT NULL,
id_empresa INT NOT NULL
);

SELECT * FROM pagamentos;
/* estou selacionando a tabela pagamentos */

DESCRIBE pagamentos;
/* Não é DLL */
/* na coluna default, serve caso nada seja add na tabela, 
ele irá com um valor padrão já pre estabelecido */

ALTER TABLE pagamentos
ADD age INT;
/* eu alterei a tabela pagamentos e add uma coluna
chamada: age, do tipo inteiro */
/* agora quando eu chamar de novo o SELECT * FROM pagamentos,
deve aparecer uma coluna a mais referente a que eu criei. */

SELECT * FROM pagamentos;
/* não preciso escrever o codigo de novo, basta eu selecinar 
o código lá em cima e mandar rodar no icone com o desenho de raio. */

/* Posso modificar uma coluna que eu já crie
nesse caso vou alterar a coluna age de inteiro para um varchar */

ALTER TABLE pagamentos
MODIFY age NVARCHAR(50) NOT NULL;
/* NVARCHAR pode ser add tanto strings quanto numeros */
/* CUIDADO, embaixo recebemos uma alerta, isso não é um erro
significa que não está de acordo com os novos padroes, mas funciona normalmente,
mas precisa tomar cuidado com os caracter, no nosso exemplo que estamos passando
irá funcionar normalmente. */
/* vamos olhar de novo */

DESCRIBE pagamentos;

/* Caso eu precise mudar o nome da minha coluna, utilizo o change, 
aqui eu mudei de age para idade */
ALTER TABLE pagamentos
CHANGE COLUMN age idade VARCHAR(50) NOT NULL;

/* Eu quero deletar a coluna idade que foi criado */
ALTER TABLE pagamentos
DROP COLUMN idade;

/* Posso trocar o nome da tabela, cuidado com o change column, 
pois eu quero alterar o nome da tabela e não da coluna */
ALTER TABLE pagamentos
RENAME TO pagamento_do_mes;

/* ou seja, quando eu for chamar mais uma vez a tabela pagamentos
iremos verificar que dará erro, pois ela não existe mais */
SELECT * FROM pagamentos;

/* para dar certo */
SELECT * FROM pagamento_do_mes;

/* posso fazer quantas vezes eu quiser, e até voltar para
o nome anterior */
ALTER TABLE pagamento_do_mes
RENAME TO pagamentos;

SELECT * FROM pagamentos;

/* para não cometer erro, podemos fazer um backup ou uma cópia da tabela,
como tem sempre dados entrando na minha tabela, 
eu quero fazer uma cópia as 8h da manhã todo santo dia, um snapshot (fotografia),
do meu DB */
CREATE TABLE pay_backup
LIKE pagamentos;

SELECT *FROM pay_backup;

/* irei inserir alguns valores para dentro da tabela pagamentos */
INSERT INTO pagamentos VALUES
(1, 3, 'USD', '01-01-1999', 'PayPal', '2', '3'); 
/* não é DLL */
/* observe que deve ser add os valores em seguencia de acordo com sua tabela */
/* os textos sempre devem estar entre aspas */
/* ao rodar, vai dar erro, pois o formato da data está errado,
deve seguir os padrões - ANO/MES/DIA, reescrevendo temos: */

INSERT INTO pagamentos VALUES
(1, 3, 'USD', '1999-12-01', 'PayPal', '2', '3'); 

SELECT * FROM pagamentos;

/* se eu quiser só apargar os dados e manter a estrutura,
eu utilizo o truncate, minha tabela vai permanecer,
mas todo o conteudo será apagado */
TRUNCATE TABLE pagamentos;

/* Apagar a tabela, quando eu faço isso eu deleto até os
dados, pois se eu apaguei a tabela, não tem onde os dados ficarem */
DROP TABLE pagamentos;
DROP TABLE pay_backup;

/* fim */
/* ------------------------------------------------------------*/

/* DML - Manipulação*/

USE AGROADVANCE;

/* estou criando minha tabela para trabalhar com DML */
CREATE TABLE compras (
id_pay INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
amount REAL NOT NULL,
currency VARCHAR(20) NOT NULL,
usuario VARCHAR(50)
);

SELECT * FROM compras;

/* agora iremos iserir valores dentro da tabela de compras */ 
INSERT INTO compras VALUES
('1', '300', 'BRL', 'Thomas'),
('2', '140', 'USD', 'Nicholas'),
('3', '129', 'EUR', 'Frederico'),
('4', '404', 'BRL', 'Louis'),
('5', '179', 'BRL', 'Franz'),
('6', '480', 'USD', ''), /* parametro vazio */
('7', '581', 'EUR', 'Ludwig');

/* Agora iremos add mais valores, mas no ID não recebera valor*/
INSERT INTO compras (amount, currency, usuario) VALUES
('932', 'USD', 'Sebastian'); 
/* Parametro ID inexistente */

/* Repare que o programa não deu erro, apesar do ID ser não nulo, 
isso funciona por causa do AUTO INCREMENTO assim que chamarmos 
mais uma vaz a tabela, podemos verificar que o ID foi incrementado ou preenchido
para o proximo valor, nesse caso inseriu o numero 8 */

SELECT * FROM compras;

/*  Para testar vamos inserir outros parametros na qual um deles será nulo
aqui seria o usuario */

INSERT INTO compras (id_pay, amount, currency) VALUES
('9', '932', 'USD');
/* Parametro usuário pode ser nulo */

INSERT INTO compras (id_pay, currency, usuario) VALUES
('10', 'EUR', 'Carlos');
/* Parametro Amount Nulo  - Pode ser */

/* Repare que nesse ultimo vai dar erro, pois amount não
pode ser nulo */

/* CUIDADO --- vazio é diferente de nulo  */

ALTER TABLE compras
MODIFY COLUMN amount REAL
DEFAULT '50';

/* INSERINDO MAIS UMA VEZ */
INSERT INTO compras (id_pay, currency, usuario) VALUES
('10', 'EUR', 'Carlos');
/* verifique que agora da certo, isso porque o amount não é mais nulo,
pois foi inserido o valor antes por um defaut,
isso significa que toda vez que não for colocado um valor,
o programa irá inserir o valor 50 sozinho, pois foi assim que pedimos. */

SELECT * FROM compras;

INSERT INTO compras VALUES
('11', '0', 'BRL', 'Jonas');

/* Repare que ao colocar o valor zero no amount, ele irá inserir normalmente e
não irá colocar o 50, somente se não for inserido nada ele irá usar o default */

/* DML - II - trabalhando com select */
USE AGROADVANCE;

SELECT * FROM compras;

/* posso selecionar a coluna que desejo visualizar */
SELECT amount FROM compras;

/* Posso descidir visualizar mais de uma coluna, entre várias  */
SELECT amount, currency FROM compras;

/*  posso inverter a ordem das colunas */
SELECT currency, amount FROM compras;

/* TRABALHANDO COM OPERADORES  */
/* Só quero visualizar alguns dados dentro da minha coluna, não quero tudo  */

SELECT * FROM compras WHERE amount = 581;
/* Repare que ao rodar, apenas irá aparecer os valores que eu pedi  */

SELECT * FROM compras WHERE amount LIKE '5%';
/* o caracter % é como um coringa, ou seja, 
pode ser qualquer ou um conjunto de caracterer
por exempolo:
51, 58417, 57, 56983, 500
desde que o primeiro numero seja 5, irá retornar */

/* Posso fazer isso tambem com letras */
/* Aqui vou buscar resultados que terminam com a letra 's' */
SELECT * FROM compras WHERE usuario LIKE '%s';

/* Aqui vou buscar resultados que terminam com a letra 'as' */
SELECT * FROM compras WHERE usuario LIKE '%as';

/* Aqui vou buscar resultados que começa com a letra 'l' */
SELECT * FROM compras WHERE usuario LIKE 'l%';

/* Aqui vou buscar resultados que tenham no meio a letra 'a' */
SELECT * FROM compras WHERE usuario LIKE '%a%';

/* POSSO INVERTER, AAGORA EU QUERO QUE ELE NÃO MOSTRE UMA CONDIÇÃO */
/* Aqui eu não quero receber resultados que terminem com a letra 's' */
SELECT * FROM compras WHERE usuario NOT LIKE '%s';

/* Outro tipo de operador, quero maior que algo */
SELECT * FROM compras WHERE amount > 140;

/* menor que */
SELECT * FROM compras WHERE amount < 140;

/* Maior e igua e menor e igual */
SELECT * FROM compras WHERE amount >= 140;
SELECT * FROM compras WHERE amount <= 140;

/* quero usuarios que não são nulos, CUIDADO, valores vazios não são nulos*/
SELECT * FROM compras WHERE usuario IS NOT NULL;

/* usuarios nulos */
SELECT * FROM compras WHERE usuario IS NULL;

/* QUERO VERIFICAR RESULTADOS QUE ESTEJAM ENTRE 2 VALORES */
SELECT * FROM compras WHERE AMOUNT BETWEEN 140 AND 200;
/* Observe que o 140 é incluso */

/* QUERO VERIFICAR RESULTADOS QUE NÃO ESTEJAM ENTRE 2 VALORES */
SELECT * FROM compras WHERE AMOUNT NOT BETWEEN 140 AND 200;

SELECT * FROM compras WHERE id_pay BETWEEN 3 AND 7;

/* -- vamos dificultar -- and ou or --*/

/* aqui eu quero resultados que começem com a letra L e termina com a letra S*/
SELECT * FROM compras WHERE usuario LIKE 'L%' AND usuario LIKE '%S';

/* aqui eu quero resultados que começem com a 
letra L """""OU""""" termina com a letra S*/
SELECT * FROM compras WHERE usuario LIKE 'L%' OR usuario LIKE '%S';

/* aqui eu quero resultados que o usuario começem com a letra L 
e amount seja maior que 400*/
SELECT * FROM compras WHERE usuario LIKE 'L%' AND amount > 400;

/* OR */
SELECT * FROM compras WHERE usuario LIKE 'L%' OR amount > 400;

/* só que algumas colunas dentros desseas condições, 
não quero que me mostre toda a tabela */
SELECT amount, usuario FROM compras WHERE usuario LIKE 'L%' OR amount > 400;

/* posso verificar resultados que não irão aparecer na tela
entretanto irá comprir as condições que propus,
Por exemplo quero veririficar quem é o usuario que condiz nessas condições */
SELECT id_pay FROM compras WHERE usuario LIKE 'L%' OR amount > 400;

/* ORDEM */
SELECT * FROM compras;
/* Aqui podemos ver que a organização é feita
pela chave primário */

SELECT * FROM compras ORDER BY usuario;
/* ira ficar em ordem alfabética, 
mas vai vim os nulos e depois os vazios primeiro */

/* ordem descrescente*/
SELECT * FROM compras ORDER BY usuario DESC;

/* somente algumas colunas */
SELECT usuario, currency FROM compras ORDER BY usuario;

/* em oredem crescrente, não precisa, mas existe */
SELECT usuario, currency FROM compras ORDER BY usuario ASC;

/* mostrar outra coluna de acordo com outra */
SELECT currency FROM compras ORDER BY usuario;

SELECT * FROM compras WHERE usuario IS NOT NULL ORDER BY usuario;

/* QUANDO QUE QUERO LIMITAR A QUANTIDADE DE RESULTADOS */

/* NA MINHA TABELA DE COMPRAS EU TENHO 11 LINHAS, QUERO SÓ 5 */
SELECT * FROM compras LIMIT 5;

/* OBSERVAÇÃO, O PROGRAMA AJUDA, NA BARRA DE FERRAMENTAS TEM 
ESSA OPÇÃO TBM */

SELECT * FROM compras LIMIT 3, 5;
/* Aqui ele vai começar a partir do terceiro e ir até o 5 */
/* CUIDADO - ELE VAI SELECIONAR OS 5, DEPOIS DO 3, (DO 3 ATÉ O 8) */
/* SE EU QUISER DO 3 ATÉ O 5 EU TRABALHO COM O BETWEEN */
SELECT * FROM compras WHERE id_pay BETWEEN 3 AND 5;

/* FUNÇÔES */

/* Agregador, o count significa contador,
o termo AS vou criar uma coluna imaginária com o nome contagem,
na qual irá me mostrar esse valor que eu pedi*/
SELECT COUNT(usuario) AS contagem FROM compras;

/* posso escrever assim, mas não fica agradavel */
SELECT COUNT(usuario) FROM compras;

/* Agregador com espaço */
SELECT COUNT (usuario) AS contagem FROM compras;
/* vai dar erro, não pode ter esse espaço */
SELECT COUNT(usuario) AS contagem de usuario FROM compras;
/* de qualquer forma, não pode ter espaço */

/* Para dar certo basta transformar em string ou colocar os underline */
SELECT COUNT(usuario) AS `contagem de usuario' FROM compras`;
 /* Nessa caso é aconselhado colocar crase, mas aqui pode ser com aspas */
 
SELECT COUNT(usuario) AS contagem_de_usuario FROM compras;

/* posso somar */
SELECT SUM(amount) AS soma FROM compras;

/* posso pedir o valor min */
SELECT MIN(amount) AS soma FROM compras;

/* posso pedir o valor maximo */
SELECT MAX(amount) AS soma FROM compras;


/* ---- Join e sub-select --- */

USE AGROADVANCE;

/* A ideia do Join é juntar duas tabelas ou mais para retirar algum resultado,
isso é feito em relação com as chaves primarias e chaves estrangeiras */


/* Vamos criar uma tabela sem chave primaria, pois o programa consegue
deduzir quem é a chave primaria e estrageira em uma outra tabela,
SE POSSÍVEL NUNCA FAÇA ISSO, NÃO É IDEIAL,
Irei criar uma segunda tabela, logo abaixo 'Account' para poder comunicar
entre essas duas tabelas */

CREATE TABLE EmailTable (
	Email NVARCHAR(50),
    
    /* smallint é ...  */
    AccountID SMALLINT NOT NULL,
    
     /* Entre crase */
    `Name` NVARCHAR(50) NOT NULL,
    
    Subcription VARCHAR (50) NOT NULL,
    
    `Active` VARCHAR (50) NOT NULL
);

/* CUIDADO - observer que eu coloquei o Active sem crases,
ela sem as crases é uma palavra reservada,
entretanto, como ela está nos padrões que está escrito de insert,
não dará problemas, mas não é ideal fazer iss, faça de modo correto */
INSERT INTO EmailTable (Email, AccountID, `Name`, Subcription, Active) VALUES
('cs@austin.com', '123', 'Carlos da Silva', 'SLG', 'Y'),
('cs@austin.com', '123', 'Carlos da Silva', 'SLG', 'N'),
('roberta@austin.com', '234', 'Roberta Souza', 'PUB', 'Y'),
('danielrosa@austin.com', '345', 'Daniel Rosa', 'LE', 'Y'),
('vitor@gmail.com', '345', 'Vitor Albuquerque', 'PUB', 'N'),
('roberta@austin.com', '345', 'Roberta Souza', 'LE', 'N'),
('francisco@email.com', '456', 'Francisco EEvvangelista', 'LE', 'Y'),
(NULL, '345', 'Juliano Maranhão', 'LE', 'N');

/* DROP TABLE Accounts; */

CREATE TABLE Accounts (
	AccountID SMALLINT PRIMARY KEY,
    HorseName NVARCHAR(50),
    `Active` VARCHAR (50) NOT NULL,
    `Activation Date` DATE NOT NULL
);
/* Pode ser que alguns gerenciadores não funciona a crase,
nesse caso, pode ser usado o colchete [],
Observação, aqui no meu não funcionou rs */


/* CUIDADO - observer que eu coloquei o Active sem crases,
ela sem as crases é uma palavra reservada,
entretanto, como ela está nos padrões que está escrito de insert,
não dará problemas, mas não é ideal fazer iss, faça de modo correto */
INSERT INTO Accounts (AccountID, HorseName, Active, `Activation Date`) VALUES
('123', 'Elba', 'y', '2021-11-01'),
('234', 'Turbo', 'y', '2021-12-01'),
('345', 'Pacato', 'n', '2021-10-01'),
('321', NULL, 'y', '2021-01-01');

SELECT *FROM Accounts;
SELECT *FROM EmailTable;

/* VAMOS COMEÇAR A VERIFICAR RESULTADOS NAS 2 TABELAS */

SELECT Email FROM EmailTable WHERE `Active`= 'Y'
AND `AccountID` IN (
	SELECT `AccountID` FROM `Accounts` WHERE `Active`='Y'
);
/* IN - significa dentro */
/* Quero acessa na minha tabela EmailTable e Accounts, e verificar os 
email de quem esta ativo,
Aqui eu acessei as duas tabelas, ou seja, ele me mostra nas duas tabelas
qo email e o accountid de quem esta ativo,
cuidado com o operador AND, aqui sóo vai mostrar o que satisfaz os dois */
/*o segundo select, seria o nosso subselect*/

/* se eu queiser ver a relação junta */

SELECT AccountID, Email FROM EmailTable WHERE `Active`= 'Y'
AND `AccountID` IN (
	SELECT `AccountID` FROM `Accounts` WHERE `Active`='Y'
);